//0. Демонстрация решения
//Напишите программу, которая на вход принимает число
//и выдаёт его квадрат (число умноженное на само себя).

Console.WriteLine("Введите число:");
string s_a = Console.ReadLine();
int a = int.Parse(s_a);
Console.WriteLine(a * a);